################################################################################################################################################################################################################################################
## Задание 1
## a - дозапись
## w - запись
## r - чтение
##
######file=open('text.txt','w')
######file.close()
######## Проверка снизу, был ли закрыт файл на True/False
######print(file.closed) #True
######print(file.name)   #text.txt
######print(file.mode)   #w
##
############################################################################################################################################################################################################################
## Задание 2
##
######file=open('text.txt','w')
######ac='ab'
######file.write('ac') #Будет записано "ас", а не содержимое переменной ac (ab)
######file.close()
##
############################################################################################################################################################################################################################
## Задание 3
##
## Содержимое файла для записи - abba
######file=open('text.txt','a')
######ab='ba'
######file.write(ab) #стало - abbaba
######file.close()
##
############################################################################################################################################################################################################################
## Задание 4
## Содержимое файла для записи -  morning
## Если ничего в моде не указано, по умолчанию - r
######file=open('text.txt')
######a=file.read() # Запись в переменную содержание файла, т.е. morning
######b=a[-1] # Считаем справо на лево (символ 'g')
######c=b+a # gmorning
######print(c)
######file.closed()
##
############################################################################################################################################################################################################################
## Задание 5
##
######a='EXPOSITION'
######print(a[::-3]) # Начало с первого символа, с конца всего диапазона каждые 3 символа = NTOE <--
######for i in range(len(a)): # len - сколько штук чего-то, т.е. тут 10 (значения от 0 до 9)
######    if i%3!=0: # 0 1 2 3 4 5 6 7 8 9, если не кратно трем (кратные - 0 3 6 9), некратные трем ( 1 2 4 5 7 8 ), % - остаток от деления
######        print(a[i].lower(), end='') # end='' выполнение записи в строку, .lower превращает большую букву в маленькую 
######    else:
######        print(a[i].replace(a[i] '1'), end='') #замена данного символа на 1, 1xp1si1i01
##
###########################################################################################################################################################################################################################
## Задание 6
##
######def ex(string):
######    index=len(string) #ticket - 6 букв, 0 1 2 3 4 5
######    res=min(string) #минимум из строки - каждый используемый символ имеет какой-то код, eg. буква a из a b c имеет меньший код и будет выведено раньше, ВЫВОД: с 
######    while index>0:
######        letter=string[index-1] #каждый проход цикла -1 (сначала 5, потом 4, 3, 2, 1, и в итоге 0)
######        print(letter, end='')
######        index=index-1
######    return(res)
######string='ticket'
######a=print("\n"+ex(string))
##
###########################################################################################################################################################################################################################
## Задание 7
##
######def ex(string):
######    res=string.count('o') # четыре "о"
######    print(("o"*7).count("oo")) #дублирование строк, ooooooo, count считает пары, ответ = 3
######    print(string.find('o')) # Ответ 1 (позиция, где находится символ - G <<o>> od afternoon!)
######    return(res)
######string='Good afternoon!'
######a=print(ex(string))
##
###########################################################################################################################################################################################################################
## Задание 8
##
######a=list(range(5))#формируется список числовых значений от 0 до 4, [0, 1, 2, 3, 4]
######b=['a','b','c','d']
######print(a)
######for i in range(len(a)):
######    if i%2!=0: # "Если индекс не кратен двум", то есть нечетные елементы мы меняем на такие с соответствующим индексом (1, 3)
######        a[i]=b[i]
######print(a)
##
###########################################################################################################################################################################################################################
## Задание 9
######a='A watched pot never boils'
######b=list(a.split())
######b.remove(b[len(b)-1])
######b.sort(reverse=True)
######for i in b:
######    print(i, end='')
######print()
######print(b)
##
###########################################################################################################################################################################################################################
## Задание 10
##
######a={1:'Fortune',2:'favors',3:'the',4:'bold'}
######b=list(a.values()) #создание списка из значений (Fortune, ...)
######v='the'
######if v in b:
######    del a[3]
######    b.sort(key=str.lower,reverse=False)
######    print(b)
######else:
######    a=update(a=3)
######print(a)
##
###########################################################################################################################################################################################################################
## Задание 11
##
######d={'a':1,'k':9,'f':1,'d':3}
######a=list(d.values()) # -> [1,9,1,3]
######b=[]
######for i in a:
######    if not(i) in b:
######        b.append(i)
######b.sort(reverse=True)
######print(b) #9,3,1
##
###########################################################################################################################################################################################################################
## Задание 12
##
######b=['k','a','d','h','e']
######a=[3,7,2,5,3]
######s={c:d for (c,d) in zip(b,a)} #{'k':3, ...}
######for c in sorted(s.keys(), reverse=True):
######    print("{0}-{1}".format(c,s[c]))
##
###########################################################################################################################################################################################################################
## Задание 13
## кортеж пишется в круглых скобках
##
a=(100,) # должна быть запятая
b='Two','one','do','make','a','four'
print(b) # -> ('Two','one',...)
print(b+2*a)
print(b[:4]+a[1:-2])
##   
